
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11820908679)


<pre><code>Plan: 3 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
* Update
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_pull_request.managed
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;dyson-rs&#34;].github_repository_pull_request.managed
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;tfgh&#34;].github_repository_pull_request.managed


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "devcontainer-features"
      + sha                          = (known after apply)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content             = <<-EOT
            # Overview :rocket:
          - > What is this pull request ?
          + > What is this pull request?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
          - > Why this pull request was created ?
          + > Why this pull request was created?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
        id                  = "devcontainer-features/.github/pull_request_template.md"
        # (8 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_pull_request.managed will be updated in-place
  ~ resource "github_repository_pull_request" "managed" {
      ~ body                  = <<-EOT
          + - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
        id                    = "hayas1:devcontainer-features:42"
        # (14 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "dyson-rs"
      + sha                          = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
            # Overview :rocket:
          - > What is this pull request ?
          + > What is this pull request?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
          - > Why this pull request was created ?
          + > Why this pull request was created?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
        id                              = "dyson-rs/.github/pull_request_template.md"
        # (11 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_pull_request.managed will be updated in-place
  ~ resource "github_repository_pull_request" "managed" {
      ~ body                  = <<-EOT
          + - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
        id                    = "hayas1:dyson-rs:9"
        # (14 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tfgh"
      + sha                          = (known after apply)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
            # Overview :rocket:
          - > What is this pull request ?
          + > What is this pull request?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
          - > Why this pull request was created ?
          + > Why this pull request was created?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
        id                              = "tfgh/.github/pull_request_template.md"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_pull_request.managed will be updated in-place
  ~ resource "github_repository_pull_request" "managed" {
      ~ body                  = <<-EOT
          + - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
        id                    = "hayas1:tfgh:59"
        # (14 unchanged attributes hidden)
    }

Plan: 3 to add, 6 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"82bbd680b3091782764399d18c5c531ac26cc35d30bd5a9ff7fafd82cb2f5098\"" -> "W/\"27cd7d0fbd401c0aa2109da512fc542385bbbf6d58753e37f81718de358a1019\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"74dbed16dd8eb7f7f064921853cce4e6f4c1e0d5e10a3e00f08217aaa32f8ae5\"" -> "W/\"c3c2b5473e45901b3ee56d8e48c54e0bc99b8862718db891b4e30ba012c5dfc9\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"518868e30fbe567a4cdf5b2ee863f6c0d0b4e0a2a0289528bf933e1f1f08a7eb\"" -> "W/\"c86733cfce573668ea037c7bad8a37040f1fd7f5f6ec2d3218c6c69b16b59c22\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":63,"Program":"tfcmt","SHA1":"721c44276c8b1ca1558098efa7af22784d99fd2e","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->